InformationRegisters/бит_СоответствияОбъектовУчетаQMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствияОбъектовУчетаQMS</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыУчетаQMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СоответствияОбъектовУчетаQMS/Ext/ManagerModule.bsl
Функция ПолучитьКодОбъекта(Объект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоответствияОбъектовУчетаQMS.Код КАК Код
		|ИЗ
		|	РегистрСведений.бит_СоответствияОбъектовУчетаQMS КАК бит_СоответствияОбъектовУчетаQMS
		|ГДЕ
		|	бит_СоответствияОбъектовУчетаQMS.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Код
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбъектПоКоду(Код) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоответствияОбъектовУчетаQMS.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.бит_СоответствияОбъектовУчетаQMS КАК бит_СоответствияОбъектовУчетаQMS
		|ГДЕ
		|	бит_СоответствияОбъектовУчетаQMS.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции
